{
  "id": "little-red-riding-hood",
  "title": "Little Red Riding Hood",
  "author": "Brothers Grimm",
  "originalSource": "Grimms' Fairy Tales (1812)",
  "culturalOrigin": "German",
  "synopsis": "A young girl in a red cloak visits her grandmother in the woods, but encounters a cunning wolf along the way.",
  "coverImageName": "little-red-riding-hood-cover",
  "estimatedReadingMinutes": 12,
  "ageRange": "4-8",
  "tags": ["classic", "fairy-tale", "animals", "family"],
  "isPurchased": true,
  "segments": [
    {
      "id": "start",
      "text": "Once upon a time, in a cozy little cottage at the edge of a great forest, there lived a sweet young girl who was loved by everyone who knew her. But no one loved her more than her dear grandmother, who lived alone in a cottage deep in the woods.\n\nOne day, Grandmother had sewn the girl a beautiful cloak of soft red velvet, with a hood to keep her warm. The girl loved this cloak so much that she wore it everywhere she went, rain or shine. Before long, everyone in the village called her Little Red Riding Hood.\n\nOne bright morning, Mother called to her from the kitchen. 'Little Red Riding Hood, come here please.' Mother's face looked worried as she packed a wicker basket with fresh-baked cake and a bottle of sweet wine.\n\n'Your grandmother is feeling poorly,' Mother explained, placing a checkered cloth over the basket. 'These treats will help her feel better. But listen carefully—you must stay on the forest path, and you must not stop to talk to strangers. The woods can be dangerous for little girls who wander.'",
      "audioFileName": "lrrh-start.m4a",
      "imageFileName": "lrrh-mother-basket",
      "isAuthenticPath": true,
      "choices": [
        {
          "id": "choice-path",
          "text": "I'll stay on the path just like Mother said.",
          "nextSegmentId": "forest-path-authentic",
          "isAuthenticPath": true
        },
        {
          "id": "choice-shortcut",
          "text": "I know a shortcut through the meadow!",
          "nextSegmentId": "meadow-shortcut",
          "isAuthenticPath": false
        },
        {
          "id": "choice-friend",
          "text": "Maybe I should ask someone to come with me.",
          "nextSegmentId": "bring-friend",
          "isAuthenticPath": false
        }
      ]
    },
    {
      "id": "forest-path-authentic",
      "text": "Little Red Riding Hood kissed her mother goodbye and set off into the forest, her basket swinging gently at her side. The morning sun filtered through the tall trees, casting dancing shadows on the winding path. Birds sang sweetly overhead, and squirrels chattered from the branches.\n\nShe had walked for some time, humming a little tune to herself, when she noticed she was no longer alone. A large wolf had stepped onto the path ahead of her. His fur was dark as shadow, and his eyes gleamed like amber in the dappled light.\n\nLittle Red Riding Hood had never seen a wolf before and did not know what a wicked creature he was. So she was not afraid when he spoke.\n\n'Good morning, Little Red Riding Hood,' said the wolf, his voice smooth as honey. 'What a lovely red cloak you're wearing. Where might you be going on this fine day?'\n\n'Good morning, sir,' she replied with a polite curtsy. 'I'm on my way to visit my grandmother, who lives in the cottage at the end of this path.'",
      "audioFileName": "lrrh-wolf-encounter.m4a",
      "imageFileName": "lrrh-wolf-path",
      "isAuthenticPath": true,
      "choices": [
        {
          "id": "choice-tell-wolf",
          "text": "Tell the wolf about grandmother's illness and the basket.",
          "nextSegmentId": "wolf-learns-details",
          "isAuthenticPath": true
        },
        {
          "id": "choice-suspicious",
          "text": "Feel suspicious and hurry away without answering.",
          "nextSegmentId": "run-from-wolf",
          "isAuthenticPath": false
        },
        {
          "id": "choice-pick-flowers",
          "text": "The wolf suggests picking flowers for grandmother.",
          "nextSegmentId": "pick-flowers",
          "isAuthenticPath": true
        }
      ]
    },
    {
      "id": "wolf-learns-details",
      "text": "'My poor grandmother is feeling poorly,' Little Red Riding Hood explained, lifting the checkered cloth to show the wolf her basket. 'See? Mother has packed fresh cake and sweet wine to help her feel better.'\n\nThe wolf's eyes grew wide at the sight of the treats, and wider still as a wicked idea formed in his mind. 'How very thoughtful you are!' he said. 'And where exactly does your dear grandmother live?'\n\n'Her cottage is just at the end of this path,' said Little Red Riding Hood, pointing ahead. 'It sits beneath three great oak trees, right beside the hazel bushes. You can't miss it!'\n\nThe wolf licked his lips, thinking what a tender young creature she was, and how much better she would taste than the old grandmother. But he knew he must be clever.\n\n'What a good grandchild you are,' said the wolf sweetly. 'But look around you at all these beautiful flowers! Wouldn't your grandmother love a fresh bouquet? And listen to the birds singing—surely you can take a moment to enjoy the forest!'\n\nBefore Little Red Riding Hood could answer, the wolf tipped his hat and bounded away through the trees, taking the shortest path he knew to grandmother's cottage.",
      "audioFileName": "lrrh-wolf-departs.m4a",
      "imageFileName": "lrrh-wolf-suggestion",
      "isAuthenticPath": true,
      "choices": [
        {
          "id": "choice-flowers-yes",
          "text": "Pick flowers for grandmother.",
          "nextSegmentId": "pick-flowers",
          "isAuthenticPath": true
        },
        {
          "id": "choice-flowers-no",
          "text": "Hurry straight to grandmother's house.",
          "nextSegmentId": "arrive-too-late",
          "isAuthenticPath": false
        }
      ]
    },
    {
      "id": "pick-flowers",
      "text": "Little Red Riding Hood looked around and saw that the wolf was right—the forest was full of beautiful wildflowers! Sunbeams streamed through gaps in the trees, lighting up patches of daisies, buttercups, and purple violets.\n\n'Grandmother would love a bouquet,' she thought to herself. 'Surely it won't hurt to pick just a few.'\n\nShe stepped off the path and began gathering flowers. But each time she picked one, she spotted an even prettier one a little farther on, and then another, and another. She wandered deeper and deeper into the forest, her arms filling with blossoms.\n\nThe birds sang, the butterflies danced, and Little Red Riding Hood quite forgot her mother's warning to stay on the path. She did not see the wolf watching her from behind a tree, his tongue hanging out with hunger. And she did not know that while she picked flowers, the wolf was racing through the forest on his four swift legs, heading straight for grandmother's cottage.",
      "audioFileName": "lrrh-flowers.m4a",
      "imageFileName": "lrrh-picking-flowers",
      "isAuthenticPath": true,
      "choices": [
        {
          "id": "choice-continue",
          "text": "Continue to grandmother's house with the flowers.",
          "nextSegmentId": "arrive-cottage",
          "isAuthenticPath": true
        }
      ]
    },
    {
      "id": "arrive-cottage",
      "text": "The wolf ran as fast as his legs could carry him until he reached the little cottage beneath the three great oak trees. He crept up to the door and knocked gently—tap, tap, tap.\n\n'Who's there?' called a weak voice from inside.\n\n'It's Little Red Riding Hood, Grandmother!' said the wolf, making his voice as sweet and high as he could. 'I've brought you cake and wine from Mother!'\n\n'Oh, my dear child!' said Grandmother. 'I'm too weak to get out of bed. Just lift the latch and let yourself in.'\n\nThe wolf lifted the latch, and the door swung open with a creak. He padded softly across the wooden floor to where Grandmother lay in her bed, her spectacles perched on her nose and her white hair tucked under a nightcap.\n\nBefore poor Grandmother could cry out, the wolf gobbled her up in one great gulp! Then the wicked creature found her spare nightgown and nightcap. He put them on, climbed into her bed, and pulled the covers up to his chin.\n\n'Now,' he said to himself, his eyes glittering in the dim room, 'I shall wait for the tender young girl to arrive.'",
      "audioFileName": "lrrh-wolf-eats-grandma.m4a",
      "imageFileName": "lrrh-wolf-in-bed",
      "isAuthenticPath": true,
      "choices": [
        {
          "id": "choice-knock",
          "text": "Little Red Riding Hood arrives and knocks.",
          "nextSegmentId": "famous-dialogue",
          "isAuthenticPath": true
        }
      ]
    },
    {
      "id": "famous-dialogue",
      "text": "At last, Little Red Riding Hood arrived at grandmother's cottage, her arms full of wildflowers. She knocked on the wooden door—tap, tap, tap.\n\n'Who's there?' called a strange, gruff voice.\n\n'It's Little Red Riding Hood, Grandmother! I've brought you cake and wine!'\n\n'Lift the latch and come in, my dear,' said the voice, trying to sound sweet.\n\nLittle Red Riding Hood lifted the latch and stepped inside. The cottage was dim, and the curtains were drawn. Grandmother was lying in bed with her nightcap pulled down low over her face and the covers pulled up high.\n\n'Put the basket on the table,' said Grandmother, 'and come sit beside me.'\n\nLittle Red Riding Hood set down her basket and flowers. As she came closer to the bed, she thought something looked very strange indeed.\n\n'Oh, Grandmother,' she said, 'what big ears you have!'\n\n'All the better to hear you with, my dear,' came the reply.\n\n'But Grandmother, what big eyes you have!' said Little Red Riding Hood, stepping closer still.\n\n'All the better to see you with, my dear.'\n\n'But Grandmother...' Little Red Riding Hood's voice trembled. 'What big teeth you have!'\n\nThe wolf threw off the covers and leaped up with a horrible growl.\n\n'All the better to EAT you with!'",
      "audioFileName": "lrrh-dialogue.m4a",
      "imageFileName": "lrrh-big-teeth",
      "isAuthenticPath": true,
      "choices": [
        {
          "id": "choice-eaten",
          "text": "What happens next?",
          "nextSegmentId": "huntsman-rescue",
          "isAuthenticPath": true
        }
      ]
    },
    {
      "id": "huntsman-rescue",
      "text": "And with that, the wolf leaped from the bed and gobbled up Little Red Riding Hood, just as he had her grandmother. Then, with his belly full at last, he climbed back into bed, closed his eyes, and fell into a deep, deep sleep. Soon he was snoring so loudly that the walls of the little cottage shook.\n\nNow it happened that a huntsman was passing through the forest that day. When he walked by grandmother's cottage, he heard the terrible snoring.\n\n'My goodness!' thought the huntsman. 'The old woman is snoring dreadfully loud. I should check that she is alright.'\n\nHe stepped inside and found not the grandmother, but the wolf, fast asleep in her bed with his great belly bulging. The huntsman raised his rifle, but then he thought, 'Wait—perhaps the wolf has swallowed the old woman, and she can still be saved!'\n\nSo instead of shooting, the huntsman took out his scissors and carefully cut open the sleeping wolf's belly. Out popped Little Red Riding Hood!\n\n'Oh, how frightened I was!' she cried. 'It was so dark inside the wolf!'\n\nThen out came Grandmother too, alive but barely able to breathe. Little Red Riding Hood quickly gathered heavy stones from the garden, and they filled the wolf's belly with them. When the wolf finally woke and tried to run away, the stones were so heavy that he fell down and could never get up again.\n\nGrandmother ate the cake and drank the wine that Little Red Riding Hood had brought, and soon she felt quite well again. And Little Red Riding Hood said to herself, 'Never again will I leave the path and wander into the forest when Mother has told me not to.'",
      "audioFileName": "lrrh-rescue.m4a",
      "imageFileName": "lrrh-huntsman",
      "isAuthenticPath": true,
      "choices": []
    },
    {
      "id": "meadow-shortcut",
      "text": "'I know a better way!' said Little Red Riding Hood to herself. 'The meadow path is much prettier, and I'll get there just as fast.'\n\nShe turned away from the dark forest and skipped into the sunny meadow instead. Oh, how beautiful it was! Golden sunlight warmed her face, and the tall grass swayed in the gentle breeze. Butterflies fluttered from flower to flower, and Little Red Riding Hood chased them, laughing with delight.\n\nShe sang songs and picked wildflowers, making a crown of daisies for her hair. The meadow seemed to go on forever, full of wonderful things to see and do.\n\nBut as the sun climbed higher in the sky, Little Red Riding Hood realized something was wrong. She had wandered so far from the path that she could no longer see the forest. Which way was grandmother's cottage? She turned this way and that, but every direction looked the same.\n\n'Oh dear,' she whispered, her lip trembling. 'I think I'm lost.'",
      "audioFileName": "lrrh-meadow.m4a",
      "imageFileName": "lrrh-meadow",
      "isAuthenticPath": false,
      "choices": [
        {
          "id": "choice-find-path",
          "text": "Try to find the way to grandmother's house.",
          "nextSegmentId": "lost-in-woods",
          "isAuthenticPath": false
        }
      ]
    },
    {
      "id": "lost-in-woods",
      "text": "Little Red Riding Hood walked and walked, searching for any sign of the path. Her feet grew tired and her basket grew heavy. The sun began to sink lower in the sky, painting the clouds orange and pink.\n\nJust when she thought she might never find her way, she spotted a thin trail winding between the trees. She followed it hopefully, pushing through brambles and stepping over fallen logs.\n\nAt last, just as the first stars appeared in the darkening sky, she saw a warm light glowing through the trees. Grandmother's cottage! She had found it!\n\nLittle Red Riding Hood ran to the door and knocked. To her great relief, Grandmother herself answered—not sick at all, but worried half to death about her missing grandchild.\n\n'Where have you been?' cried Grandmother, pulling her into a tight hug. 'I've been waiting for you all day!'\n\nLittle Red Riding Hood told her grandmother about the meadow and getting lost, and Grandmother made them both hot tea to go with the cake and wine. As they ate their supper by the fire, Little Red Riding Hood made a solemn promise.\n\n'I will always listen to Mother from now on,' she said. 'And I will never, ever leave the path again.'",
      "audioFileName": "lrrh-lost-ending.m4a",
      "imageFileName": "lrrh-late-arrival",
      "isAuthenticPath": false,
      "choices": []
    },
    {
      "id": "bring-friend",
      "text": "Little Red Riding Hood thought for a moment. The forest could be dark and lonely, and Mother had seemed so worried. Perhaps it would be better not to go alone.\n\nShe walked to the cottage next door, where her friend Peter lived. Peter was a brave boy who knew the forest well.\n\n'Peter!' she called. 'Will you walk with me to Grandmother's cottage? I have to bring her cake and wine, but the forest path is long.'\n\n'Of course!' said Peter, grabbing his walking stick. 'Two is always better than one on a forest adventure.'\n\nThe two friends set off together, chatting and laughing as they walked. The forest didn't seem nearly so dark with a friend by her side.\n\nBut then, around a bend in the path, they came face to face with a large wolf. His eyes gleamed hungrily at Little Red Riding Hood.\n\nPeter stepped forward immediately, holding up his walking stick. 'That's a wolf!' he said firmly. 'I've seen them before. Stay behind me!'\n\nThe wolf looked at Peter, then at the stick, then back at Little Red Riding Hood. Two children were more trouble than one, and that stick looked hard. With a frustrated growl, the wolf slunk away into the shadows to find easier prey.",
      "audioFileName": "lrrh-friend.m4a",
      "imageFileName": "lrrh-with-friend",
      "isAuthenticPath": false,
      "choices": [
        {
          "id": "choice-safe-arrival",
          "text": "Continue safely to grandmother's house.",
          "nextSegmentId": "safe-arrival",
          "isAuthenticPath": false
        }
      ]
    },
    {
      "id": "safe-arrival",
      "text": "With the wolf gone, Little Red Riding Hood and Peter continued down the forest path, feeling much braver now. Peter kept his walking stick ready, just in case, but they saw no more wolves—only friendly squirrels and singing birds.\n\nWhen they reached the cottage beneath the three great oak trees, Grandmother was sitting by the window, watching for visitors. Her face lit up with joy when she saw them.\n\n'My dear child!' she cried, hurrying to open the door. 'And you've brought a friend! How wonderful!'\n\nGrandmother was feeling poorly indeed, with a cough and a fever, but she insisted on making tea for her guests. Little Red Riding Hood unpacked the basket—the fresh cake and sweet wine that Mother had sent.\n\n'This is just what I needed,' said Grandmother, taking a sip of wine. The color began to return to her cheeks.\n\nThey spent the afternoon together, telling stories by the fire. Grandmother taught them how to play cat's cradle with string, and Peter told tales of his adventures in the forest. When the shadows grew long, Peter walked Little Red Riding Hood safely home before dark.\n\nMother was waiting at the door. When she heard about the wolf, her face went pale.\n\n'You were very wise to bring a friend,' she said, hugging them both tightly. 'There is safety in numbers, and true friends look out for each other.'\n\nFrom that day on, Little Red Riding Hood never walked through the forest alone. And whenever she thought of the wolf's gleaming eyes, she was grateful for brave friends like Peter.",
      "audioFileName": "lrrh-safe-ending.m4a",
      "imageFileName": "lrrh-happy-ending",
      "isAuthenticPath": false,
      "choices": []
    },
    {
      "id": "run-from-wolf",
      "text": "Something about the wolf made Little Red Riding Hood's heart beat faster. Perhaps it was the way he licked his lips, or the hungry gleam in his amber eyes. Mother's warning echoed in her mind: 'Do not stop to talk to strangers.'\n\nWithout answering the wolf's question, Little Red Riding Hood clutched her basket tightly and ran. Her red cloak streamed behind her like a banner as she flew down the forest path, her feet barely touching the ground.\n\n'Wait!' called the wolf, surprised by her sudden flight. 'I only wanted to—'\n\nBut Little Red Riding Hood did not look back. She ran until her lungs burned and her legs ached, past twisted trees and mossy stones, until at last she burst out of the dark forest and saw grandmother's cottage beneath the three great oak trees.\n\nShe pounded on the door with her small fist. 'Grandmother! Grandmother, let me in!'\n\nThe door opened, and there stood Grandmother—not in bed at all, but wrapped in her favorite shawl and looking much better than expected.\n\n'My goodness, child!' said Grandmother, pulling her inside. 'You look like you've seen a ghost!'\n\nBetween gasping breaths, Little Red Riding Hood told her grandmother about the wolf on the path. Grandmother's face grew serious.\n\n'You were very wise to run,' she said, bolting the door and checking the windows. 'Wolves are clever creatures with silver tongues. Many a traveler has been tricked by their sweet words.'\n\nThey shared the cake and wine together, keeping the curtains drawn and the fire burning bright. When it was time to go home, Grandmother walked Little Red Riding Hood all the way back to her cottage, taking the long way around, far from where the wolf might be lurking.\n\nThat night, as Mother tucked her into bed, Little Red Riding Hood made a promise she would keep forever: 'I will always trust my feelings when something seems wrong. And I will never, ever talk to strangers in the forest.'",
      "audioFileName": "lrrh-run-ending.m4a",
      "imageFileName": "lrrh-running",
      "isAuthenticPath": false,
      "choices": []
    },
    {
      "id": "arrive-too-late",
      "text": "Little Red Riding Hood did not stop to pick flowers. Something about the wolf's eager questions made her uneasy. She hurried down the path as fast as her legs could carry her, the basket bumping against her side.\n\nBut even running, she could not match the wolf's four swift legs. He knew shortcuts through the forest that no human had ever discovered.\n\nWhen Little Red Riding Hood finally reached grandmother's cottage, her heart sank. The wooden door hung open on its hinges, creaking in the breeze. Inside, furniture was overturned and Grandmother's favorite teacup lay shattered on the floor.\n\n'Grandmother?' she called, her voice trembling. 'Grandmother, where are you?'\n\nThere was no answer—only an eerie silence.\n\nTears began to roll down Little Red Riding Hood's cheeks. She was about to run for help when she heard a voice from outside.\n\n'Stand back, child!' It was the huntsman, a tall man with kind eyes and a rifle on his shoulder. He had been tracking the wolf through the forest for days. 'I saw the beast running this way. Is anyone hurt?'\n\n'My grandmother!' cried Little Red Riding Hood. 'I can't find her!'\n\nThe huntsman searched the cottage carefully. Then he noticed something—the closet door was locked from the inside.\n\n'Hello?' he called gently. 'Is someone in there?'\n\n'Is the wolf gone?' came a shaky voice.\n\n'Grandmother!' Little Red Riding Hood ran to the closet door. 'It's me! You're safe now!'\n\nThe door creaked open, and out stepped Grandmother, pale but unharmed. When she had heard the wolf's footsteps and his horrible attempt to imitate Little Red Riding Hood's voice, she had hidden in the closet and held the door shut with all her might.\n\n'He tried and tried to get in,' Grandmother said, 'but the lock held fast. When he heard you coming down the path, he ran away into the forest.'\n\nThe huntsman promised to track down the wolf and make sure he never bothered anyone again. Little Red Riding Hood hugged her grandmother tightly, so grateful she was safe.\n\n'I should have come faster,' Little Red Riding Hood whispered. 'I should have known something was wrong.'\n\n'But you did know,' said Grandmother, stroking her hair. 'You didn't stop to pick flowers. You listened to that little voice inside you. And that's what saved us both.'",
      "audioFileName": "lrrh-alternate-ending.m4a",
      "imageFileName": "lrrh-closet-rescue",
      "isAuthenticPath": false,
      "choices": []
    }
  ]
}
